In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv("Salary Dataset.csv")

In [4]:
df

,Company Name,Job Title,Salaries Reported,Location,Salary
0,Mu Sigma,Data Scientist,105.0,Bangalore,"₹6,48,573/yr"
1,IBM,Data Scientist,95.0,Bangalore,"₹11,91,950/yr"
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,"₹8,36,874/yr"
3,Impact Analytics,Data Scientist,40.0,Bangalore,"₹6,69,578/yr"
4,Accenture,Data Scientist,32.0,Bangalore,"₹9,44,110/yr"
...,...,...,...,...,...
4339,TaiyōAI,Machine Learning Scientist,1.0,Mumbai,"₹5,180/mo"
4340,Decimal Point Analytics,Machine Learning Developer,1.0,Mumbai,"₹7,51,286/yr"
4341,MyWays,Machine Learning Developer,1.0,Mumbai,"₹4,10,952/yr"
4342,Market Pulse Technologies,Software Engineer - Machine Learning,1.0,Mumbai,"₹16,12,324/yr"
4343,vPhrase,Machine Learning Engineer,1.0,Mumbai,"₹9,39,843/yr"

# Find unique company name and value

In [6]:
df["Company Name"].unique()

array(['Mu Sigma', 'IBM', 'Tata Consultancy Services', ...,
       'Myraa Technologies', 'TaiyōAI', 'Market Pulse Technologies'],
      dtype=object)

In [7]:
df["Company Name"].value_counts()

Tata Consultancy Services     41
Amazon                        32
Accenture                     30
Google                        27
Fresher                       26
                              ..
URS Technologies Solutions     1
Aniket Sonawane                1
Brahman bhetun                 1
Airavaat Car Rentals           1
Market Pulse Technologies      1
Name: Company Name, Length: 2529, dtype: int64

# Max job title in all company top 5

In [11]:
df["Job Title"].unique()

array(['Data Scientist', 'Data Science Associate',
       'Data Science Consultant', 'Data Science', 'Senior Data Scientist',
       'Junior Data Scientist', 'Lead Data Scientist',
       'Data Science Manager', 'Data Scientist - Trainee',
       'Data Science Lead', 'Data Analyst', 'Data Engineer',
       'Machine Learning Engineer', 'Machine Learning Software Engineer',
       'Software Engineer - Machine Learning',
       'Machine Learning Engineer/Data Scientist',
       'Machine Learning Consultant', 'Machine Learning Data Associate',
       'Machine Learning Data Associate I', 'Machine Learning Associate',
       'Machine Learning Data Associate II',
       'Associate Machine Learning Engineer',
       'Machine Learning Data Analyst',
       'Senior Machine Learning Engineer', 'Machine Learning Scientist',
       'Machine Learning Developer'], dtype=object)

In [9]:
df["Job Title"].value_counts().head()

Data Scientist               1844
Data Analyst                  990
Data Engineer                 805
Machine Learning Engineer     568
Data Science                   43
Name: Job Title, dtype: int64

# Location wise maximum job opportunity

In [10]:
df["Location"].value_counts()

Bangalore    1584
Pune          818
Hyderabad     669
New Delhi     656
Mumbai        617
Name: Location, dtype: int64

# Find the null values of df and if numeric value are absent then fill that value.

In [13]:
df.isnull().sum()

Company Name         3
Job Title            0
Salaries Reported    2
Location             0
Salary               0
dtype: int64

In [23]:
df[["Salaries Reported"]].isnull().sum()

Salaries Reported    2
dtype: int64

In [24]:
y=df[["Salaries Reported"]]

In [30]:
x=y.fillna(method="ffill")

In [61]:
x

      Salaries Reported
0                 105.0
1                  95.0
2                  66.0
3                  40.0
4                  32.0
...                 ...
4339                1.0
4340                1.0
4341                1.0
4342                1.0
4343                1.0

[4344 rows x 1 columns]

In [62]:
df[["Salaries Reported"]]=x

In [63]:
df

,Company Name,Job Title,Salaries Reported,Location,Salary
0,Mu Sigma,Data Scientist,105.0,Bangalore,NaN
1,IBM,Data Scientist,95.0,Bangalore,₹1191950
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,₹836874
3,Impact Analytics,Data Scientist,40.0,Bangalore,₹669578
4,Accenture,Data Scientist,32.0,Bangalore,₹944110
...,...,...,...,...,...
4339,TaiyōAI,Machine Learning Scientist,1.0,Mumbai,₹5180mo
4340,Decimal Point Analytics,Machine Learning Developer,1.0,Mumbai,₹751286
4341,MyWays,Machine Learning Developer,1.0,Mumbai,₹410952
4342,Market Pulse Technologies,Software Engineer - Machine Learning,1.0,Mumbai,₹1612324
4343,vPhrase,Machine Learning Engineer,1.0,Mumbai,₹939843

# Change salary object into int

In [97]:
df["Salary"]=df["Salary"].str.replace("mo","")
df["Salary"]=df["Salary"].str.replace("hr","")

In [98]:
z=df["Salary"].fillna("$648573")

In [99]:
z

0        648573
1       1191950
2        836874
3        669578
4        944110
         ...
4339       5180
4340     751286
4341     410952
4342    1612324
4343     939843
Name: Salary, Length: 4344, dtype: object

In [100]:
d=[]
for i in z:
    d.append(i[1:])

In [74]:
df["Salary"]=d

In [102]:
df

,Company Name,Job Title,Salaries Reported,Location,Salary
0,Mu Sigma,Data Scientist,105.0,Bangalore,648573
1,IBM,Data Scientist,95.0,Bangalore,1191950
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,836874
3,Impact Analytics,Data Scientist,40.0,Bangalore,669578
4,Accenture,Data Scientist,32.0,Bangalore,944110
...,...,...,...,...,...
4339,TaiyōAI,Machine Learning Scientist,1.0,Mumbai,5180
4340,Decimal Point Analytics,Machine Learning Developer,1.0,Mumbai,751286
4341,MyWays,Machine Learning Developer,1.0,Mumbai,410952
4342,Market Pulse Technologies,Software Engineer - Machine Learning,1.0,Mumbai,1612324
4343,vPhrase,Machine Learning Engineer,1.0,Mumbai,939843

# Get company name and salary by location wise

In [104]:
df.groupby(["Company Name","Location"]).get_group(("IBM","Mumbai"))

     Company Name       Job Title  Salaries Reported Location   Salary
1786          IBM  Data Scientist                3.0   Mumbai  1193120
1846          IBM  Data Scientist                1.0   Mumbai   205476
1847          IBM  Data Scientist                1.0   Mumbai   702485
2870          IBM    Data Analyst                2.0   Mumbai   998289
3630          IBM   Data Engineer                3.0   Mumbai  1018095

# Average Salary reported in banglore location by ibm

In [110]:
df.groupby(["Company Name","Location"]).get_group(("IBM","Bangalore"))["Salaries Reported"]

1       95.0
95       4.0
646      1.0
880      1.0
1961    31.0
2943    46.0
3011     3.0
Name: Salaries Reported, dtype: float64

In [108]:
df.groupby(["Company Name","Location"]).get_group(("IBM","Bangalore"))["Salaries Reported"].mean()

25.857142857142858

# MAx

In [109]:
df.groupby(["Company Name","Location"]).get_group(("IBM","Bangalore"))["Salaries Reported"].max()

95.0

# min

In [111]:
df.groupby(["Company Name","Location"]).get_group(("IBM","Bangalore"))["Salaries Reported"].min()

1.0